Octopus/Documents/vrgЗаказКлиентаМобильный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>vrgЗаказКлиентаМобильный</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУзлаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданНаМобильномУстройстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отобран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезналичныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранзакцииAbills</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплаченНаличными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплаченБезналичными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОплату</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДоп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Octopus/InformationRegisters/vrgОстаткиНаСкладахМобильныеСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>vrgОстаткиНаСкладахМобильныеСклад</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/Documents/vrgТребованияНакладнаяМобыльный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>vrgТребованияНакладнаяМобыльный</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУзлаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданНаМобильномУстройстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отобран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаселенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Улицы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБокса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОпоры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьиЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезналичныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранзакцииAbills</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговаяАкция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.vrgЗаказКлиентаМобильный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Octopus/Documents/vrgЗаказКлиентаМобильный/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.КоличествоЗаказ = 0;
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ОбновитьОстатокНоменклатуры", Истина);
	СтруктураДействий.Вставить("ОбновитьАртикулНоменклатуры", Истина);
	СтруктураДействий.Вставить("ОбновитьЦенуНоменклатуры", Истина);
	СтруктураДействий.Вставить("ОбновитьЕдиницуИзмерения", Истина);
	СтруктураДействий.Вставить("ОбновитьКоэффициент", Истина);
	СтруктураДействий.Вставить("ПересчитатьСумму", Истина);
	ОбработатьСтрокуТабличнойЧастиНоменклатуры(ТекущиеДанные.ПолучитьИдентификатор(), СтруктураДействий);

КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуТабличнойЧастиНоменклатуры(ИдентификаторСтроки, СтруктураДействий)

	//СтрокаТовары = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	//Если СтруктураДействий.Свойство("ОбновитьЕдиницуИзмерения") Тогда
	//	СтрокаТовары.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
	//КонецЕсли;
	//Если СтруктураДействий.Свойство("ОбновитьКоэффициент") Тогда
	//	СтрокаТовары.Коэффициент = СтрокаТовары.ЕдиницаИзмерения.Коэффициент;
	//КонецЕсли;
	//Если СтруктураДействий.Свойство("ОбновитьЦенуНоменклатуры") Тогда
	//	ЦенаНоменклатуры = 0;
	//	Если ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
	//		ЦенаНоменклатуры = Разработка.ПолучитьЦену(СтрокаТовары.Номенклатура, СтрокаТовары.ЕдиницаИзмерения, Объект.ТипЦен, СтрокаТовары.ХарактеристикаНоменклатуры);
	//	КонецЕсли;
	//	СтрокаТовары.Цена = ЦенаНоменклатуры;
	//КонецЕсли;
	//Если СтруктураДействий.Свойство("ПересчитатьСумму") Тогда
	//	СтрокаТовары.Сумма = СтрокаТовары.Количество * СтрокаТовары.Цена;
	//	ПересчитатьСуммуДокумента();
	//КонецЕсли;
	//Если СтруктураДействий.Свойство("ОбновитьОстатокНоменклатуры") Тогда
	//	ОстатокНоменклатуры = 0;
	//	Если ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
	//		ОстатокНоменклатуры = Разработка.ПолучитьОстаток(СтрокаТовары.Номенклатура, Объект.Склад, СтрокаТовары.СерияНоменклатуры, СтрокаТовары.ХарактеристикаНоменклатуры);
	//	КонецЕсли;
	//	СтрокаТовары.Остаток = ОстатокНоменклатуры;
	//КонецЕсли;
	//Если СтруктураДействий.Свойство("ОбновитьАртикулНоменклатуры") Тогда
	//	СтрокаТовары.Артикул = СтрокаТовары.Номенклатура.Артикул;
	//КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуДокумента()

	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)

	ОбработатьВводШтрихкодаНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводШтрихкодаНаКлиенте(ДобавлятьНовуюСтрокуТоваров = Ложь)

	ТекущаяСтрока = Неопределено;
	Модифицированность = Истина;
	Если НЕ ЗначениеЗаполнено(СокрЛП(Штрихкод)) Тогда
		Возврат;
	КонецЕсли;
	ОбработатьВводШтрихкодаНаСервере();

	Если РучнойВводКоличества И ШтрихкодНайден Тогда
		ТекущийЭлемент = Элементы.Номенклатура;
		ОткрытьФорму("ОбщаяФорма.ФормаВводаКоличества", , ЭтотОбъект);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросДобавлятьНовуюСтрокуТоваровЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Если РучнойВводКоличества Тогда
			ТекущийЭлемент = Элементы.Номенклатура;
			ОткрытьФорму("ОбщаяФорма.ФормаВводаКоличества", , ЭтотОбъект);
			Возврат;
		Иначе
			ДобавитьОбработатьСтрокуТоваров();
			Если ТипЗнч(ТекущаяСтрока) = Тип("Число") Тогда
				Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары;
				Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если НажатаКомандаСканированияЧерезКамеру Тогда
		ЗапуститьСканированиеЧерезКамеруУстройства();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОбработатьВводШтрихкодаНаСервере()

	ВыборкаШтрихкода = Разработка.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
	ШтрихкодНайден = (ВыборкаШтрихкода.Количество() <> 0);
	Если ВыборкаШтрихкода.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШтрихкода, , "Штрихкод");
		//Цена = Разработка.ПолучитьЦену(Номенклатура, ЕдиницаИзмерения, Объект.ТипЦен);
		//Сумма = Цена * Количество;
		//МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура, СерияНоменклатуры", Номенклатура, СерияНоменклатуры));
		//Если МассивСтрок.Количество() = 0 Тогда
		//	Возврат Ложь;
		Если НЕ РучнойВводКоличества Тогда
			ДобавитьОбработатьСтрокуТоваров();
		КонецЕсли;
	Иначе
		Сообщить("По штрихкоду """ + СокрЛП(Штрихкод) + """ не знайдено жодного товару!");
	КонецЕсли;

	Штрихкод = "";

	Возврат Истина;

КонецФункции

&НаСервере
Процедура ДобавитьОбработатьСтрокуТоваров()

	МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения));
	Если МассивСтрок.Количество() > 0 Тогда
		СтрокаТовары = МассивСтрок[0];
	Иначе
		СтрокаТовары = Объект.Товары.Вставить(0);
		СтрокаТовары.Остаток = Разработка.ПолучитьОстаток(Номенклатура, Объект.Склад, СерияНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения);
		//СтрокаТовары.Артикул = Номенклатура.Артикул;
	КонецЕсли;
	СтрокаТовары.Номенклатура = Номенклатура;
	СтрокаТовары.СерияНоменклатуры = СерияНоменклатуры;
	СтрокаТовары.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	СтрокаТовары.ЕдиницаИзмерения = ЕдиницаИзмерения;
	СтрокаТовары.Коэффициент = Коэффициент;
	//+NovashIV_21.04.2023 007375
	Если СтрокаТовары.Остаток < СтрокаТовары.Количество + ?(РучнойВводКоличества, РучноеКоличество, 1) Тогда 
		Сообщить("Неможливо ввести більше залишку!");
	Иначе
		СтрокаТовары.Количество = СтрокаТовары.Количество + ?(РучнойВводКоличества, РучноеКоличество, 1);
		СтрокаТовары.Отсканировано = (СтрокаТовары.Количество = СтрокаТовары.КоличествоЗаказ И СтрокаТовары.КоличествоЗаказ > 0);
	КонецЕсли;
	//-NovashIV_21.04.2023 007375
	СтрокаТовары.Цена = Разработка.ПолучитьЦену(Номенклатура, ЕдиницаИзмерения, Объект.ТипЦен, ХарактеристикаНоменклатуры);
	СтрокаТовары.Сумма = СтрокаТовары.Цена * СтрокаТовары.Количество;
	
		
	Количество = СтрокаТовары.Количество;
	Цена = СтрокаТовары.Цена;
	Сумма = СтрокаТовары.Сумма;
	КоличествоЗаказ = СтрокаТовары.КоличествоЗаказ;
	ТекущаяСтрока = СтрокаТовары.ПолучитьИдентификатор();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьДополнительныеДанныеВТоварахНаСервере();

	РежимОбновленияКартинок = Константы.РежимОбновленияКартинок.Получить();

	УправлениеФормамиСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	
	Если Объект.Оплачен Тогда 
		
		Элементы.КнопкаЗафиксироватьОплатуБезналичные.Доступность = Ложь;
		Элементы.КнопкаЗафиксироватьОплатуНаличные.Доступность    = Ложь;


		Элементы.КнопкаЗафиксироватьОплатуБезналичные.ЦветФона = ?(Объект.ОплаченБезналичными,WebЦвета.ЗеленоватоЖелтый,WebЦвета.Белый);
		Элементы.КнопкаЗафиксироватьОплатуНаличные.ЦветФона    = ?(Объект.ОплаченНаличными,WebЦвета.ЗеленоватоЖелтый,WebЦвета.Белый);
	Иначе
		
		
		
		Если Объект.Организация = Справочники.Организации.НайтиПоКоду("000000005") Тогда
			Элементы.КнопкаЗафиксироватьОплатуБезналичные.Видимость = Ложь;
			Элементы.КнопкаЗафиксироватьОплатуНаличные.Видимость    = Истина;
			
		ИначеЕсли Объект.Организация = Справочники.Организации.НайтиПоКоду("000000000") Тогда
			
			Элементы.КнопкаЗафиксироватьОплатуБезналичные.Видимость =Истина;
			Элементы.КнопкаЗафиксироватьОплатуНаличные.Видимость    = Ложь;
			
		КонецЕсли;
		
		
		
		
	КонецЕсли;
	
	Если Объект.БезналичныйРасчет Тогда 
		
		Элементы.КнопкаЗафиксироватьОплатуБезналичные.Доступность = Ложь;
		Элементы.КнопкаЗафиксироватьОплатуНаличные.Доступность    = Ложь;

			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеДанныеВТоварахНаСервере()

	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		СтрокаТовары.Остаток = Разработка.ПолучитьОстаток(СтрокаТовары.Номенклатура, Объект.Склад, СтрокаТовары.СерияНоменклатуры, СтрокаТовары.ХарактеристикаНоменклатуры, СтрокаТовары.ЕдиницаИзмерения);
		СтрокаТовары.Отсканировано = (СтрокаТовары.Количество = СтрокаТовары.КоличествоЗаказ И СтрокаТовары.КоличествоЗаказ > 0);
		//СтрокаТовары.Артикул = СтрокаТовары.Номенклатура.Артикул;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВводаКоличества" Тогда
		Если ТипЗнч(ВыбранноеЗначение) <> Тип("Число") ИЛИ НЕ ВыбранноеЗначение > 0 Тогда
			Возврат;
		КонецЕсли;
		РучноеКоличество = ВыбранноеЗначение;
		ДобавитьОбработатьСтрокуТоваров();
		//ТекущийЭлемент = Элементы.Штрихкод;
		//#Если МобильноеПриложениеКлиент Тогда
		//НачатьРедактированиеЭлемента();
		//#КонецЕсли

	//+NovashIV_21.04.2023 007375
	//ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВыбораСтрокиТовара" Тогда
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВыбораСтрокиТовараАльтернатива" Тогда
	//-NovashIV_21.04.2023 007375
	
		Модифицированность = Истина;
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		Если ВыбранноеЗначение.НомерСтроки > Объект.Товары.Количество() Тогда
			ТекущиеДанные = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
		Иначе
			ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
		КонецЕсли;
		ТекущаяСтрока = ТекущиеДанные.ПолучитьИдентификатор();
		Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	// для того, чтобы точно клавиатура пряталась или открывалась
	//Если ТекущаяСтраница = Элементы.СтраницаСканирование Тогда
	//	ТекущийЭлемент = Элементы.Штрихкод;
	//	НачатьРедактированиеЭлемента();
	//Иначе
	//	//ТекущийЭлемент = Элементы["ДекорацияДляФокусировки" + ТекущаяСтраница.Имя];
	//	//НачатьРедактированиеЭлемента()
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаказПоставщикуПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.ЗаказПоставщику) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
		ТекстВопроса = "Заповнити документ надходження за обраним замовленням постачальнику?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//ПланыОбмена.ЗарегистрироватьИзменения(Константы.УзелЦентральнойБазы.Получить(), Объект.Ссылка);
	Если не ЗначениеЗаполнено(Объект.УИДДокумента) Тогда 
		Объект.УИДДокумента = Объект.Ссылка.УникальныйИдентификатор(); 
		Модифицированность = Истина
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	Записать();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)

	Если ОткрытаФормаРедактированияНоменклатуры Тогда
		Возврат;
	КонецЕсли;
	Если ФормаДокументаЗаблокирована Тогда
		Возврат;
	КонецЕсли;

	Если Событие = "UniversalBroadcastEvent" и Источник = глНомерУстройства Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Данные);
		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		МассивЭлементов = ДокументDOM.ПолучитьЭлементыПоИмени("FilterData");
		Если МассивЭлементов.Количество() Тогда
			Штрихкод = МассивЭлементов[0].ТекстовоеСодержимое;
			ОбработатьВводШтрихкодаНаКлиенте();
			Если ОткрытаФормаСтроки Тогда
				СтруктураСканирования = Новый Структура();
				СтруктураСканирования.Вставить("Номенклатура", Номенклатура);
				СтруктураСканирования.Вставить("Количество", Количество);
				СтруктураСканирования.Вставить("ЦветФонаСтроки", ПолучитьЦветСтроки(Элементы.Товары.ТекущиеДанные));
				Оповестить("UniversalBroadcastEvent", СтруктураСканирования, ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
		//Если ТипЗнч(ТекущаяСтрока) = Тип("Число") Тогда
		//	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары;
		//	Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока;
		//КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкрыватьОтсканированныеПриИзменении(Элемент)

	Элементы.Товары.ОтборСтрок = Неопределено;
	Если СкрыватьОтсканированные Тогда
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Отсканировано", Ложь);
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	СтрокаТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТовары.Отсканировано = (СтрокаТовары.Количество = СтрокаТовары.КоличествоЗаказ И СтрокаТовары.КоличествоЗаказ > 0);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрыНоменклатуры(Команда)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Сообщить("У поточному рядку не вказана номенклатура");
		Возврат;
	КонецЕсли;

	ОписаниеОповещенияОЗакрытииРедактированияНоменклатуры = Новый ОписаниеОповещения("ЗакрытиеРедактированияНоменклатуры", ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Новый Структура("Ключ, ИдентификаторСтроки, ИзменениеПараметровНоменклатуры",
						ТекущиеДанные.Номенклатура, Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор(), Истина), ЭтаФорма,
						, , , ОписаниеОповещенияОЗакрытииРедактированияНоменклатуры);
	ОткрытаФормаРедактированияНоменклатуры = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеРедактированияНоменклатуры(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ОткрытаФормаРедактированияНоменклатуры = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура СканироватьЧерезКамеруУстройства(Команда)

	НажатаКомандаСканированияЧерезКамеру = Истина;
	ЗапуститьСканированиеЧерезКамеруУстройства();

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСканированиеЧерезКамеруУстройства()

	ИдетСканированиеЧерезКамеру = Истина;
	РучнойВводКоличества = Ложь;
	#Если МобильноеПриложениеКлиент Тогда
	ОбработчикСканирования = Новый ОписаниеОповещения("ПоказатьСканированиеШтрихКодовЗавершение", ЭтаФорма);
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ПоказатьСканированиеШтрихКодовЗакрытие", ЭтаФорма);
	СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(, ОбработчикСканирования, ОбработчикЗакрытия, ТипШтрихКода.Линейный);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОстановитьСканированиеЧерезКамеруУстройства()

	Если ИдетСканированиеЧерезКамеру Тогда
		ПрограммноеЗакрытиеСканированияЧерезКамеру = Истина;
		#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		ИдетСканированиеЧерезКамеру = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСканированиеШтрихКодовЗавершение(ОтсканированныйШтрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт

	Штрихкод = СокрЛП(ОтсканированныйШтрихкод);
	ОбработатьВводШтрихкодаНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСканированиеШтрихКодовЗакрытие(ДополнительныеПараметры) Экспорт

	Если НЕ ПрограммноеЗакрытиеСканированияЧерезКамеру Тогда
		НажатаКомандаСканированияЧерезКамеру = Ложь;
	КонецЕсли;
	ПрограммноеЗакрытиеСканированияЧерезКамеру = Ложь;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруСтрокиТабЧастиТовары(ЭтоДобавление = Ложь, ЗаполнитьТекущимиДанными = Ложь)

	СтруктураСтроки = Новый Структура("НомерСтроки, Номенклатура, Количество, Остаток, ЕдиницаИзмерения, Коэффициент, Цена, Сумма, СерияНоменклатуры, ХарактеристикаНоменклатуры");
	ЦветФонаСтроки = Новый Цвет;
	Если ЗаполнитьТекущимиДанными Тогда
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущиеДанные);
		ЦветФонаСтроки = ПолучитьЦветСтроки(ТекущиеДанные);
	КонецЕсли;
	Если ЭтоДобавление Тогда
		СтруктураСтроки.НомерСтроки = Объект.Товары.Количество() + 1;
	КонецЕсли;
	СтруктураСтроки.Вставить("РежимОбновленияКартинок", РежимОбновленияКартинок);
	СтруктураСтроки.Вставить("ЦветФонаСтроки", ЦветФонаСтроки);
	СтруктураСтроки.Вставить("Склад", Объект.Склад);
	СтруктураСтроки.Вставить("ТипЦен", Объект.ТипЦен);

	Возврат СтруктураСтроки;

КонецФункции

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;
	ОткрытьФормуВыбораСтрокиТовара(Истина, Копирование);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	ОткрытьФормуВыбораСтрокиТовара(, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтрокиТовара(Добавление = Ложь, Копирование = Ложь)

	СтруктураСтрокаТовары = ПолучитьСтруктуруСтрокиТабЧастиТовары(Добавление, Копирование);
	ПараметрыФормы = Новый Структура("СтруктураСтрокаТовары", СтруктураСтрокаТовары);
	//+NovashIV_21.04.2023 007375
	//ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтрокиТовара", ПараметрыФормы, ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтрокиТовараАльтернатива", ПараметрыФормы, ЭтаФорма);
	//-NovashIV_21.04.2023 007375

	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЦветСтроки(СтрокаТабличнойЧасти)

	ЦветФонаСтроки = Новый Цвет;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат ЦветФонаСтроки;
	КонецЕсли;

	//Если СтрокаТабличнойЧасти.КоличествоЗаказ <> 0 И СтрокаТабличнойЧасти.КоличествоЗаказ <> СтрокаТабличнойЧасти.Количество И СтрокаТабличнойЧасти.Количество <> 0 Тогда
	//	ЦветФонаСтроки = WebЦвета.Розовый;
	//ИначеЕсли СтрокаТабличнойЧасти.КоличествоЗаказ <> 0 И СтрокаТабличнойЧасти.КоличествоЗаказ = СтрокаТабличнойЧасти.Количество Тогда
	//	ЦветФонаСтроки = WebЦвета.БледноЗеленый;
	//ИначеЕсли СтрокаТабличнойЧасти.КоличествоЗаказ = 0 И СтрокаТабличнойЧасти.Количество <> 0 Тогда
	//	ЦветФонаСтроки = WebЦвета.СветлоЗолотистый;
	//КонецЕсли;

	Возврат ЦветФонаСтроки;

КонецФункции

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ОбновитьЦенуНоменклатуры", Истина);
	СтруктураДействий.Вставить("ОбновитьКоэффициент", Истина);
	СтруктураДействий.Вставить("ПересчитатьСумму", Истина);
	ОбработатьСтрокуТабличнойЧастиНоменклатуры(ТекущиеДанные.ПолучитьИдентификатор(), СтруктураДействий);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	ПересчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)

	ПересчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	КонтрагентПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()

	Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговорКонтрагента;
	Если НЕ ЗначениеЗаполнено(Объект.ТипЦен) Тогда
		Объект.ТипЦен = Объект.ДоговорКонтрагента.ТипЦен;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)

	ЗаполнитьДополнительныеДанныеВТоварахНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)

	//ОписаниеОповещенияИзменениеЦен = Новый ОписаниеОповещения("ВопросИзменениеТипаЦенЗавершение", ЭтаФорма);
	//ТекстВопроса = "";
	//ПоказатьВопрос(ОписаниеОповещенияИзменениеЦен, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , , "Изменение цен");

КонецПроцедуры

&НаКлиенте
Процедура ВопросИзменениеТипаЦенЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УправлениеФормамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	ПодключитьОбработчикАвтосохранения();

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикАвтосохранения()

	Если ИспользоватьАвтосохранение <> Истина
		ИЛИ ИнтервалАвтосохранения = 0 Тогда
			Возврат;
	КонецЕсли;

	ПодключитьОбработчикОжидания("ВыполнитьАвтосохранениеДокумента", ИнтервалАвтосохранения);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтосохранениеДокумента() Экспорт

	Попытка
		Записать();
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)

	УправлениеФормамиКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);

КонецПроцедуры

//+NovashIV_24.01.2023

&НаКлиенте
Процедура ОткрытьСписокФото(Команда)

	Если Объект.Ссылка.Пустая() Тогда 
		Сообщить("Збережіть документ для створення фото!");
	Иначе 	
		Объект.УИДДокумента = Объект.Ссылка.УникальныйИдентификатор(); 
		Модифицированность = Истина;
		Записать();

		СтандартнаяОбработка = Ложь;
		
		ПараметрыОтбора = Новый Структура("УИД",Объект.Ссылка.УникальныйИдентификатор());
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("УИД",Объект.Ссылка.УникальныйИдентификатор());
		ПараметрыФормы.Вставить("Наименование",Объект.Номер);
		ПараметрыФормы.Вставить("Склады",Null);
		ПараметрыФормы.Вставить("типДок",Объект.Ссылка);
		
		ОткрытьФорму("ОбщаяФорма.ПросмотрФотоДок", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если не ЗначениеЗаполнено(Объект.УИДДокумента) Тогда 
		Объект.УИДДокумента = Объект.Ссылка.УникальныйИдентификатор(); 
		Модифицированность = Истина
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчетнымиОстатками(Команда)
	//+NovashIV_19.12.2022 Перенес с инвентаризации
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщить("Не вказано склад!");
		Возврат;
	КонецЕсли;

	Если Объект.Товары.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
		ТекстВопроса = "Табличну частину товарів буде перезаповнено. Продовжити?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

	ЗаполнитьУчетнымиОстаткамиНаСервере();
	//+NovashIV_19.12.2022
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчетнымиОстаткамиНаСервере()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОстаткиНаСкладахМобильныеСклад.Номенклатура КАК Номенклатура,
	|	ОстаткиНаСкладахМобильныеСклад.Номенклатура.Артикул КАК Артикул,
	|	ОстаткиНаСкладахМобильныеСклад.Номенклатура.Наименование КАК Наименование,
	|	ОстаткиНаСкладахМобильныеСклад.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиНаСкладахМобильныеСклад.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ОстаткиНаСкладахМобильныеСклад.Количество КАК Остаток,
	|	ОстаткиНаСкладахМобильныеСклад.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.vrgОстаткиНаСкладахМобильныеСклад КАК ОстаткиНаСкладахМобильныеСклад
	|ГДЕ
	|	ОстаткиНаСкладахМобильныеСклад.Склад = &Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.Текст = ТекстЗапроса;
	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьУчетнымиОстаткамиНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОплатитьНаличные(Команда)
	
	
	Оповещание = Новый ОписаниеОповещения("ПослеОтветаНаВопросОплатаНаличные",ЭтаФорма);
	
	ПоказатьВопрос(Оповещание,"Ви впевненні що хоче провести оплату?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаБезналичные(Команда)
	Оповещание = Новый ОписаниеОповещения("ПослеОтветаНаВопросОплатаБезналичные",ЭтаФорма);
	
	ПоказатьВопрос(Оповещание,"Ви впевненні що хоче провести оплату?",РежимДиалогаВопрос.ДаНет);
	
	
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеОтветаНаВопросОплатаБезналичные(Результат,Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если ПроверитьТчТовары() Тогда
			
			ПоказатьПредупреждение(,"Потрібно спочатку заповнити серії в товарах");
			 Объект.Оплачен 			   = Ложь;
			 Объект.ОплаченБезналичными = Ложь;
		 Возврат;	
		КонецЕсли;
		
		Объект.Оплачен 			   = Истина;
		Объект.ОплаченБезналичными = Истина;
		Объект.ОтветственныйЗаОплату = ПолучитьТекущегоПользователя();
		Объект.ДатаОплаты = ТекущаяДата();
		Если Объект.Оплачен Тогда 
			
			Элементы.КнопкаЗафиксироватьОплатуБезналичные.Доступность = Ложь;
			Элементы.КнопкаЗафиксироватьОплатуНаличные.Доступность    = Ложь;
			
			Элементы.КнопкаЗафиксироватьОплатуБезналичные.ЦветФона = ?(Объект.ОплаченБезналичными,WebЦвета.ЗеленоватоЖелтый,WebЦвета.Белый);
			Элементы.КнопкаЗафиксироватьОплатуНаличные.ЦветФона    = ?(Объект.ОплаченНаличными,WebЦвета.ЗеленоватоЖелтый,WebЦвета.Белый);
			
			
		КонецЕсли;

		Записать();	

	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеОтветаНаВопросОплатаНаличные(Результат,Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		
		Если ПроверитьТчТовары() Тогда
			
			ПоказатьПредупреждение(,"Потрібно спочатку заповнити серії в товарах");
			Объект.Оплачен = Ложь;
			Объект.ОплаченНаличными = Ложь;

		 Возврат;	
		КонецЕсли;

		
		
		Объект.Оплачен = Истина;
		Объект.ОплаченНаличными = Истина;
		Объект.ОтветственныйЗаОплату = ПолучитьТекущегоПользователя();
		Объект.ДатаОплаты = ТекущаяДата();
		
		Если Объект.Оплачен Тогда 
			
			Элементы.КнопкаЗафиксироватьОплатуБезналичные.Доступность = Ложь;
			Элементы.КнопкаЗафиксироватьОплатуНаличные.Доступность    = Ложь;
			
			
			Элементы.КнопкаЗафиксироватьОплатуБезналичные.ЦветФона = ?(Объект.ОплаченБезналичными,WebЦвета.ЗеленоватоЖелтый,WebЦвета.Белый);
			Элементы.КнопкаЗафиксироватьОплатуНаличные.ЦветФона    = ?(Объект.ОплаченНаличными,WebЦвета.ЗеленоватоЖелтый,WebЦвета.Белый);
			
		КонецЕсли;
		
		Записать();	
		
		
	КонецЕсли;
	
	
КонецПроцедуры

	
&НаСервере
Функция ПолучитьТекущегоПользователя()
	Возврат Константы.ПользовательПоУмолчанию.Получить();	
КонецФункции

&НаКлиенте
Процедура СформироватьТребованиеНакладнаяНаСервере(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СформироватьТребованиеНакладнаяСервер();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТребованиеНакладная(Команда)
		
	Оповещание = Новый ОписаниеОповещения("ОбработкаЗакрытияВопроса",ЭтаФорма);
	
	ПоказатьВопрос(Оповещание,"Ви впевненні, що хочете сформувати вимогу накладну?",РежимДиалогаВопрос.ДаНет);
	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаЗакрытияВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	// Проверяем, нажал ли пользователь "Да"
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		// Вызываем серверную процедуру для создания документа.
		// Она вернет нам ссылку на созданный документ.
		СсылкаНовогоДокумента = СформироватьТребованиеНакладнаяСервер();
		
		// Если ссылка получена (документ создан успешно), открываем его форму.
		Если СсылкаНовогоДокумента <> Неопределено Тогда
			// Универсальный метод открытия формы по ссылке
			ОткрытьЗначение(СсылкаНовогоДокумента);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТребованиеНакладнаяСервер()

	Если УжеЕстьТребование(Объект.Ссылка) Тогда
		Сообщить("По замовленню вже є вимога накладна");
		Возврат Неопределено;
	КонецЕсли;
	
	ДокТребование = Документы.vrgТребованияНакладнаяМобыльный.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокТребование, Объект,,"Дата, Номер, УИДДокумента");
	
	ДокТребование.Дата 							= ТекущаяДата();
	ДокТребование.Абонент 						= Объект.Контрагент;
	ДокТребование.Заказ							= Объект.Ссылка;
	ДокТребование.СозданНаМобильномУстройстве 	= Истина;

	//ДокТребование.Товары.Загрузить(Объект.Товары.Выгрузить());
	Попытка
		ДокТребование.Записать();
		Сообщить("Документ вимога створено");
		Возврат  ДокТребование.Ссылка;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
		 Возврат Неопределено;
Конецфункции
&НаСервереБезКонтекста
Функция УжеЕстьТребование(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vrgТребованияНакладнаяМобыльный.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.vrgТребованияНакладнаяМобыльный КАК vrgТребованияНакладнаяМобыльный
		|ГДЕ
		|	vrgТребованияНакладнаяМобыльный.Заказ = &Заказ
		|	И НЕ vrgТребованияНакладнаяМобыльный.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции // УжеЕстьТребование()




&НаКлиенте
Процедура СоздатьПеремещениеТоваров(Команда)
		
	Оповещание = Новый ОписаниеОповещения("ОбработкаЗакрытияВопросаПеремещение",ЭтаФорма);
	
	ПоказатьВопрос(Оповещание,"Ви впевненні, що хочете створити переміщення товарів?",РежимДиалогаВопрос.ДаНет);
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияВопросаПеремещение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	// Проверяем, нажал ли пользователь "Да"
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		// Вызываем серверную процедуру для создания документа.
		// Она вернет нам ссылку на созданный документ.
		СсылкаНовогоДокумента = СоздатьПеремещениеТоваровСервер();
		
		// Если ссылка получена (документ создан успешно), открываем его форму.
		Если СсылкаНовогоДокумента <> Неопределено Тогда
			// Универсальный метод открытия формы по ссылке
			ОткрытьЗначение(СсылкаНовогоДокумента);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьПеремещениеТоваровСервер()

	Если УжеЕстьПеремещение(Объект.Ссылка) Тогда
		Сообщить("По замовленню вже є переміщення товарів");
		Возврат Неопределено;
	КонецЕсли;
	
	ДокПеремещение = Документы.vrgПеремещениеМобильное.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокПеремещение, Объект,,"Дата, Номер, УИДДокумента");
	
	ДокПеремещение.Дата = ТекущаяДата();
	ДокПеремещение.СкладОтправитель = Константы.СкладПоУмолчанию.Получить();
	ДокПеремещение.СкладПолучатель = Справочники.Склады.НайтиПоНаименованию("ТестДрайв");
	ДокПеремещение.Заказ = Объект.Ссылка;
	ДокПеремещение.СозданНаМобильномУстройстве = Истина;

	ДокПеремещение.Товары.Загрузить(Объект.Товары.Выгрузить());
	
	Попытка
		ДокПеремещение.Записать();
		Сообщить("Документ переміщення створено");
		Возврат ДокПеремещение.Ссылка;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция УжеЕстьПеремещение(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vrgПеремещениеМобильное.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.vrgПеремещениеМобильное КАК vrgПеремещениеМобильное
		|ГДЕ
		|	vrgПеремещениеМобильное.Заказ = &Заказ
		|	И НЕ vrgПеремещениеМобильное.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции // УжеЕстьПеремещение()




&НаСервере
функция ПроверитьТчТовары()  
	
	
	НужноПроставитьСериюТоваров = Ложь;
	
	Для каждого СтрокиТч Из Объект.Товары Цикл
		
		Если  СтрокиТч.Номенклатура.ВестиУчетПоСериям Тогда
			
			Если Не ЗначениеЗаполнено(СтрокиТч.СерияНоменклатуры) Тогда
				
				НужноПроставитьСериюТоваров = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
			
		
		
		
	КонецЦикла;
	
	
	Возврат НужноПроставитьСериюТоваров 
	
КонецФункции
